# GetOpacityByClassN

```pascal
PROCEDURE GetOpacityByClassN(
				h                        : HANDLE;
				VAR isPenOpacityByClass  : BOOLEAN;
				VAR isFillOpacityByClass : BOOLEAN);
```

```python
def vs.GetOpacityByClassN(h):
    return (isPenOpacityByClass, isFillOpacityByClass)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|   |
|isPenOpacityByClass|BOOLEAN|   |
|isFillOpacityByClass|BOOLEAN|   |

## Version
Availability: from Vectorworks 2017

## Category
* Object Attributes